uhnp/src/Catalogs/АналитическаяПодписка/АналитическаяПодписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитическаяПодписка</name>
  <comment>Настройки рассылки почтовых уведомлений</comment>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициацияРассылки</name>
    <comment>0 - регламентное задание, 1 - по завершению этапа процесса, 2 - по контрольному соотношению</comment>
    <type>
      <types>EnumRef.ВидыИнициацииРассылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РассылаемыйОбъект</name>
    <type>
      <types>CatalogRef.АналитическиеПанели</types>
      <types>CatalogRef.МониторыКлючевыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравнения_Период</name>
    <type>
      <types>EnumRef.ВидыСравненияДляАналитическихПодписок</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеЗначенийОтбора</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПанели</name>
    <type>
      <types>CatalogRef.СохраненныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантАналитическойРасылкиПоказателей</name>
    <type>
      <types>EnumRef.УдалитьВариантыАналитическойРассылкиПоказателей</types>
      <types>EnumRef.ВариантыАналитическойРассылкиПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение_Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение_Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение_ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение_ПериодОтчетаОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение_Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение_ПериодОтчетаОтн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение_ПериодОтчетаОкончаниеОтн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьРассылку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСКД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРассылки</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтролируемыеПоказатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиМонитораКлючевыхПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольСостояния</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольДинамики</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыИсточников</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РассылаемыеСостояния</name>
    <attributes>
      <name>СостояниеПоказателяМКП</name>
      <type>
        <types>EnumRef.СостоянияПоказателейМКП</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РассылаемыеТренды</name>
    <attributes>
      <name>ТрендПоказателяМКП</name>
      <type>
        <types>EnumRef.ТрендыПоказателейМКП</types>
        <types>EnumRef.УдалитьТрендыПоказателейМКП</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ВидыИнициацииРассылки/ВидыИнициацииРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнициацииРассылки</name>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
  <enumValues>
    <name>КонтрольПоказателяМКП</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыСравненияДляАналитическихПодписок/ВидыСравненияДляАналитическихПодписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСравненияДляАналитическихПодписок</name>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>ОтносительныйПериод</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыЭлементовАналитическойПанели/ВидыЭлементовАналитическойПанели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовАналитическойПанели</name>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>Гистограмма</name>
  </enumValues>
  <enumValues>
    <name>График</name>
  </enumValues>
  <enumValues>
    <name>КруговаяДиаграмма</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаГоризонтальная</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластями</name>
  </enumValues>
  <enumValues>
    <name>ТочечнаяДиаграмма</name>
  </enumValues>
  <enumValues>
    <name>ИзмерительнаяДиаграмма</name>
  </enumValues>
  <enumValues>
    <name>РадарныйГрафик</name>
  </enumValues>
  <enumValues>
    <name>Воронка</name>
  </enumValues>
  <enumValues>
    <name>Поверхность</name>
  </enumValues>
  <enumValues>
    <name>ПолеИндикатора</name>
  </enumValues>
  <enumValues>
    <name>ДекорацияКартинка</name>
  </enumValues>
  <enumValues>
    <name>ДекорацияНадпись</name>
  </enumValues>
  <enumValues>
    <name>ДиаграммаГанта</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/АналитическиеПанели/АналитическиеПанели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитическиеПанели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазметкаПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.ВидыЭлементовАналитическойПанели</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиЭлемента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкрытьЗаголовокЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксироватьОтборы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраницыПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтраницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФонаСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеИБ</name>
    <attributes>
      <name>ТипИБ</name>
      <type>
        <types>CatalogRef.ТипыБазДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ВнешниеИнформационныеБазы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПротоколРассылки/ПротоколРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПротоколРассылки</name>
  <comment>Протокол рассылки электронных сообщений по аналитической подписке</comment>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.АналитическаяПодписка</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКомпоновщика</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяНастройка</name>
    <type>
      <types>CatalogRef.СохраненныеНастройки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатРассылки</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРассылки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/АналитическаяПодписка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СформироватьРегламентноеЗаданиеДляНастроекРассылки(НастройкаРассылки) Экспорт
	
	РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("РассылкаПоНастройкамРассылки");
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(РЗ.УникальныйИдентификатор);
	РЗ.Параметры = МассивПараметров;
	РЗ.Записать();
	
	Возврат РЗ.УникальныйИдентификатор;
	
КонецФункции   

Процедура ПодготовитьРассылкуПоНастройкамРассылки(ПараметрРассылки, ОбъектРассылки = Неопределено) Экспорт

	Если ТипЗнч(ПараметрРассылки) = Тип("УникальныйИдентификатор") Тогда
		ИспользуетсяУникальныйИдентификатор = Истина;
	ИначеЕсли ТипЗнч(ПараметрРассылки) = Тип("СправочникСсылка.АналитическаяПодписка") Тогда
		ИспользуетсяУникальныйИдентификатор = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитическаяПодписка.Ссылка КАК Ссылка,
	|	АналитическаяПодписка.ВерсияДанных КАК ВерсияДанных,
	|	АналитическаяПодписка.Код КАК Код,
	|	АналитическаяПодписка.Наименование КАК Наименование,
	|	АналитическаяПодписка.РегламентноеЗадание КАК РегламентноеЗадание,
	|	АналитическаяПодписка.ИнициацияРассылки КАК ИнициацияРассылки,
	|	АналитическаяПодписка.ШаблонСообщения КАК ШаблонСообщения,
	|	АналитическаяПодписка.ВидСравнения_Период КАК ВидСравнения_Период,
	|	АналитическаяПодписка.ХранилищеЗначенийОтбора КАК ХранилищеЗначенийОтбора,
	|	АналитическаяПодписка.НастройкаПанели КАК НастройкаПанели,
	|	АналитическаяПодписка.ЗаголовокПисьма КАК ЗаголовокПисьма,
	|	АналитическаяПодписка.РассылаемыйОбъект КАК РассылаемыйОбъект,
	|	ВЫБОР
	|		КОГДА АналитическаяПодписка.РассылаемыйОбъект ССЫЛКА Справочник.АналитическиеПанели
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Панель,
	|	АналитическаяПодписка.КонтролируемыеПоказатели.(
	|		Показатель КАК Показатель,
	|		КонтрольСостояния КАК КонтрольСостояния,
	|		КонтрольДинамики КАК КонтрольДинамики,
	|		ИмяГруппыИсточников КАК ИмяГруппыИсточников
	|	) КАК КонтролируемыеПоказатели,
	|	АналитическаяПодписка.Значение_Периодичность КАК Значение_Периодичность,
	|	АналитическаяПодписка.Значение_ПериодОтчетаОтн КАК Значение_ПериодОтчетаОтн,
	|	АналитическаяПодписка.Значение_ПериодОтчетаОкончаниеОтн КАК Значение_ПериодОтчетаОкончаниеОтн,
	|	АналитическаяПодписка.Значение_ПериодОтчетаОкончание КАК Значение_ПериодОтчетаОкончание
	|ИЗ
	|	Справочник.АналитическаяПодписка КАК АналитическаяПодписка" 
	+ ?(ИспользуетсяУникальныйИдентификатор, "
	|ГДЕ
	|	АналитическаяПодписка.РегламентноеЗадание = &ПараметрРассылки"
	,"
	|ГДЕ
	|	АналитическаяПодписка.Ссылка = &ПараметрРассылки");
	
	Запрос.УстановитьПараметр("ПараметрРассылки", ПараметрРассылки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураЗначений = Выборка.ХранилищеЗначенийОтбора.Получить();
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		ЗаголовокПисьма   = Выборка.ЗаголовокПисьма;
		ШаблонПисьма      = Выборка.ШаблонСообщения;
		СтруктураПараметровШаблона = ВернутьСтруктуруПараметровШаблонаПисьма(ШаблонПисьма);
		МассивПутейВложений = Новый Массив;
		
				
		НоваяЗапись                           = Справочники.ПротоколРассылки.СоздатьЭлемент();
		НоваяЗапись.Источник                  = Выборка.Ссылка;
		НоваяЗапись.Наименование              = СтрШаблон(
			НСтр("ru = 'Рассылка от %1'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			Формат(ТекущаяДата(), 
				НСтр("ru='Л=ru; ДФ=dd.MM.yyyy; ДЛФ=DD; ДП=2'", ОбщегоНазначения.КодОсновногоЯзыка()) ));
		НоваяЗапись.НастройкиКомпоновщика     = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
		НоваяЗапись.СохраненнаяНастройка      = Выборка.НастройкаПанели;
		
		ТекстПоПоказателям = "";
		
		Если Выборка.ИнициацияРассылки = Перечисления.ВидыИнициацииРассылки.КонтрольПоказателяМКП Тогда
			// Сформируем таблицу показателей МКП и поместим его в переменную ТекстПоПоказателям.
			ВыгрузкаТаблицыПоказателей = Выборка.КонтролируемыеПоказатели.Выгрузить();
			ТекстПоПоказателям = БизнесАнализСерверУХ.ПолучитьHtmlТаблицуПоказателейМкп(Выборка.РассылаемыйОбъект, Выборка.НастройкаПанели, ВыгрузкаТаблицыПоказателей, Выборка.Ссылка);
		ИначеЕсли Выборка.ИнициацияРассылки = Перечисления.ВидыИнициацииРассылки.РегламентноеЗадание Тогда	
			// Аналитическая панель. Вложим выгрузку аналитических отчетов.
			МассивПутейВложений = ПолучитьМассивПутейФайловВложенийАналитическойПанели(Выборка.РассылаемыйОбъект, ПараметрРассылки);
		Иначе
			// Неизвестный вариант. Выведем ошибку.
			ТекстПоПоказателям = ТекстПоПоказателям + "<div>" + НСтр("ru = 'Неизвестный вариант формирования рассылки: %ВариантРассылки%'") + "</div>";
			ТекстПоПоказателям = СтрЗаменить(ТекстПоПоказателям, "%ВариантРассылки%", Строка(Выборка.ИнициацияРассылки));
			ТекстСообщения = НСтр("ru = 'Неизвестный вариант формирования рассылки: %ВариантРассылки%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВариантРассылки%", Строка(Выборка.ИнициацияРассылки));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
		
		ТекстСписокВложений = ПолучитьТекстСпискаВложений(МассивПутейВложений);
		СтруктураПараметровШаблона.Вставить("СписокВложений", ТекстСписокВложений);
		СтруктураПараметровШаблона.Вставить("КонтролируемыеПоказатели", ТекстПоПоказателям);
		СписокПользователей = БизнесАнализСерверУХ.ПолучитьСписокПользователейАналитическойРассылки(ОбъектРассылки, Выборка.Ссылка);
		
		Если СписокПользователей.Количество() = 0 Тогда
			Возврат;		// Нет получателей рассылки.
		КонецЕсли;
		
		ТекстОшибки = "";
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаОтправкиПочтовогоСообщения", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
		КонецПопытки;
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ТекстСообщениеОбОшибке = НСтр("ru = 'Не определена учетная запись для отправки электронной почты'");
			ЗаписьЖурналаРегистрации("ОшибкаОтправкиПочтовогоСообщения", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщениеОбОшибке);
			Возврат;
		КонецЕсли;
		
		ТаблицаОтправки = УправлениеКонтактнойИнформациейПереопределяемыйУХ.ПолучитьТаблицуЭлектронныхАдресов(СписокПользователей);
		
		Для Каждого СтрокаТаблицы Из ТаблицаОтправки Цикл
			
			АдресПолучателя = СтрокаТаблицы.Адрес;
			ПолучательСсылка = СтрокаТаблицы.Объект;
			ДатаРассылки = ТекущаяДата();
			
			Если СтруктураПараметровШаблона.Свойство("Пользователь") Тогда
				СтруктураПараметровШаблона.Вставить("Пользователь", ПолучательСсылка);
			КонецЕсли;
			
			Если СтруктураПараметровШаблона.Свойство("Дата") Тогда
				СтруктураПараметровШаблона.Вставить("Дата", ДатаРассылки);
			КонецЕсли;
			
			Если СтруктураПараметровШаблона.Свойство("Ссылка") Тогда
				ТекстСсылки = НСтр("ru = '<a href=""%НавигационнаяСсылка%"">%Представление%</a>'");
				ТекстСсылки = СтрЗаменить(ТекстСсылки, "%НавигационнаяСсылка%", Строка(ПолучитьНавигационнуюСсылку(НоваяЗапись.Ссылка)));
				ТекстСсылки = СтрЗаменить(ТекстСсылки, "%Представление%", Строка(НоваяЗапись.Ссылка));
				СтруктураПараметровШаблона.Вставить("Ссылка", ТекстСсылки);	
			КонецЕсли;
			
			ТекстПисьма = ШаблонПисьма;
			
			Для Каждого Элемент Из СтруктураПараметровШаблона Цикл
				ТекстПисьма = СтрЗаменить(ТекстПисьма, "%%" + Элемент.Ключ + "%%", Элемент.Значение);
			КонецЦикла;
			// Преобразуем ссылки во внешние.
			ТекстПисьма = МодульУправленияОповещениямиУХ.ПреобразоватьНавигационныеСсылкиВоВнешние(ТекстПисьма);
			// Добавим строку записи в протокол.
			НоваяСтрока                  = НоваяЗапись.РезультатРассылки.Добавить();
			НоваяСтрока.Пользователь     = ПолучательСсылка;
			НоваяСтрока.ЭлектроннаяПочта = АдресПолучателя;
			НоваяСтрока.ДатаРассылки     = ДатаРассылки;
			// Сформируем и отправим письмо.
			ОтправитьПисьмоАналитическойРассылки(ЗаголовокПисьма, ТекстПисьма, МассивПутейВложений, УчетнаяЗапись, АдресПолучателя, НоваяСтрока,ПараметрРассылки);
		КонецЦикла;
		
		НоваяЗапись.Результат = ?(ПустаяСтрока(ТекстОшибки), "ОК", ТекстОшибки);
		НоваяЗапись.Записать();
		
	КонецЕсли;

КонецПроцедуры

Функция ВернутьСтруктуруПараметровШаблонаПисьма(ШаблонПисьма)
	
	СтруктураПараметров = Новый Структура;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%Пользователь%%")>0 Тогда
		СтруктураПараметров.Вставить("Пользователь");
	КонецЕсли;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%Дата%%")>0 Тогда
		СтруктураПараметров.Вставить("Дата");
	КонецЕсли;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%Ссылка%%")>0 Тогда
		СтруктураПараметров.Вставить("Ссылка");
	КонецЕсли;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%ОтборОрганизация%%")>0 Тогда
		СтруктураПараметров.Вставить("ОтборОрганизация");
	КонецЕсли;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%ОтборПериод%%")>0 Тогда
		СтруктураПараметров.Вставить("ОтборПериод");
	КонецЕсли;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%ОтборСценарий%%")>0 Тогда
		СтруктураПараметров.Вставить("ОтборСценарий");
	КонецЕсли;
	
	Если СтрЧислоВхождений(ШаблонПисьма, "%%ОтборВалюта%%")>0 Тогда
		СтруктураПараметров.Вставить("ОтборВалюта");
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Возвращает массив, содержащий пути файлов для вложения в аналитическую
// рассылку по аналитической панели ПанельВход.
Функция ПолучитьМассивПутейФайловВложенийАналитическойПанели(ПанельВход, АналитическаяПодпискаВход = Неопределено)
	
	Перем ДанныеРасшифровки;
	РезультатФункции 				= Новый Массив;
	
	ЭтаФорма = Новый Структура;
	ЭтаФорма.Вставить("URLСхемы","");
	ЭтаФорма.Вставить("URLСхемыНастроек","");
	ЭтаФорма.Вставить("АдресТаблицыДанных","");
	ЭтаФорма.Вставить("УникальныйИдентификатор",Новый УникальныйИдентификатор);
	ЭтаФорма.Вставить("ШаблонПанели",ПанельВход);
	ЭтаФорма.Вставить("Элементы",Новый Массив());
	ЭтаФорма.Вставить("РежимРаботыСДанными",Истина);
	ЭтаФорма.Вставить("ПоследнийИндексОбъектаТабДок",0);
	
	ЭтаФорма.Вставить("Сценарий",АналитическаяПодпискаВход.Значение_Сценарий);
	ЭтаФорма.Вставить("Валюта",АналитическаяПодпискаВход.Значение_Валюта);
	
	//Отборы по периоду
	Если АналитическаяПодпискаВход.ВидСравнения_Период  = Перечисления.ВидыСравненияДляАналитическихПодписок.Равно Тогда
		
		ЭтаФорма.Вставить("ПериодОтчета",АналитическаяПодпискаВход.Значение_ПериодОтчета);
		ЭтаФорма.Вставить("ПериодОкончания",АналитическаяПодпискаВход.Значение_ПериодОтчетаОкончание);
		
	ИначеЕсли АналитическаяПодпискаВход.ВидСравнения_Период  = Перечисления.ВидыСравненияДляАналитическихПодписок.ОтносительныйПериод Тогда
		
		ЭтаФорма.Вставить("ПериодОтчета",ПолучитьОтносительныйПериод(АналитическаяПодпискаВход.Значение_Периодичность,АналитическаяПодпискаВход.Значение_ПериодОтчетаОтн));
		ЭтаФорма.Вставить("ПериодОтчетаОкончание",ПолучитьОтносительныйПериод(АналитическаяПодпискаВход.Значение_Периодичность,АналитическаяПодпискаВход.Значение_ПериодОтчетаОкончаниеОтн));
		
	КонецЕсли;
	
	
	ИспользуемыеИБ = Новый ТаблицаЗначений;
	ИспользуемыеИБ.Колонки.Добавить("ТипИБ",Новый ОписаниеТипов("СправочникСсылка.ТипыБазДанных"));
	ИспользуемыеИБ.Колонки.Добавить("ИнформационнаяБаза",Новый ОписаниеТипов("СправочникСсылка.ВнешниеИнформационныеБазы"));	
	
	ЭтаФорма.Вставить("ИспользуемыеИБ",ИспользуемыеИБ);	
	ЭтаФорма.Вставить("КомпоновщикНастроек",Новый КомпоновщикНастроекКомпоновкиДанных);
	
	ИнициализироватьСКДИсточника(ЭтаФорма,ПанельВход);
	
	//Получим данные из пакета
	ПолучитьТаблицуДанныхПакета(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ПанельВход) Тогда
		
		РазметкаПанели = ПанельВход.РазметкаПанели.Выгрузить();
		РазметкаПанели.Колонки.Добавить("АдресДанныхРасшифровки");
		
		Для Каждого СтрокаЭлемента Из РазметкаПанели Цикл
			
			ТабДокумент = Новый ТабличныйДокумент;
			
			ЭтаФорма.Вставить(СтрокаЭлемента.ИмяРеквизитаФормы);
			
			Если СтрокаЭлемента.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.Таблица Тогда
				
				Справочники.АналитическиеПанели.ОбновитьФреймТаблицы(ЭтаФорма,СтрокаЭлемента);
				ТабДокумент.Вывести(ЭтаФорма[СтрокаЭлемента.ИмяРеквизитаФормы]);
				
			ИначеЕсли СтрокаЭлемента.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ПустаяСсылка() Тогда
				
				Продолжить;
				
			ИначеЕсли СтрокаЭлемента.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ПолеИндикатора Тогда	
				
				ЭтаФорма.Вставить("ТабличныйДокумент"+ЭтаФорма.ПоследнийИндексОбъектаТабДок,ТабДокумент); 
				Справочники.АналитическиеПанели.ОбновитьФреймИндикатора(ЭтаФорма,СтрокаЭлемента);	   
				ТабДокумент.Вывести(ЭтаФорма["ТабличныйДокумент"+ЭтаФорма.ПоследнийИндексОбъектаТабДок]);
				
			ИначеЕсли СтрокаЭлемента.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ДекорацияНадпись Тогда
				
				//декорации не рассылаем
				Продолжить;
				
			ИначеЕсли СтрокаЭлемента.ТипОбъекта = Перечисления.ВидыЭлементовАналитическойПанели.ДекорацияКартинка Тогда
				
				//декорации не рассылаем
				Продолжить;
				
			Иначе 
				//Поле диаграммы
				Справочники.АналитическиеПанели.ОбновитьФреймДиаграммы(ЭтаФорма,СтрокаЭлемента,ТабДокумент);	
				
			КонецЕсли;
					
			ТекОтчет = Неопределено;	
			
			ДобавитьВМассивВложениеАналитическогоОтчета(СтрокаЭлемента, ТабДокумент,РезультатФункции);
				
		КонецЦикла;
		
	Иначе
		РезультатФункции = Новый Массив;		// Панель не задана. Вернём пустой массив.
	КонецЕсли;
	
	Возврат РезультатФункции;

КонецФункции

Функция ПолучитьОтносительныйПериод(Периодичность,ПериодОтчетаОтн)
	
	Если Периодичность  = Перечисления.Периодичность.Год Тогда
		
		ДатаНовогоПериода =  НачалоГода(ДобавитьМесяц(ТекущаяДата(),ПериодОтчетаОтн*12));
		
	ИначеЕсли Периодичность  = Перечисления.Периодичность.Полугодие Тогда 
	
		ДатаНовогоПериода =  НачалоКвартала(ДобавитьМесяц(ТекущаяДата(),ПериодОтчетаОтн*6));
		
	ИначеЕсли Периодичность  = Перечисления.Периодичность.Квартал Тогда 
	
		ДатаНовогоПериода =  НачалоКвартала(ДобавитьМесяц(ТекущаяДата(),ПериодОтчетаОтн*3));
		
	ИначеЕсли Периодичность  = Перечисления.Периодичность.Месяц Тогда 
	
		ДатаНовогоПериода =  НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),ПериодОтчетаОтн));
	
	ИначеЕсли Периодичность  = Перечисления.Периодичность.Декада Тогда 
	
		ДатаНовогоПериода =  НачалоДня(ТекущаяДата()+ПериодОтчетаОтн*60*60*24*10);	
		
	ИначеЕсли Периодичность  = Перечисления.Периодичность.Неделя Тогда 
	
		ДатаНовогоПериода =  НачалоНедели(ТекущаяДата()+ПериодОтчетаОтн*60*60*24*7);
		
	ИначеЕсли Периодичность  = Перечисления.Периодичность.День Тогда 
	
		ДатаНовогоПериода =  НачалоДня(ТекущаяДата()+ПериодОтчетаОтн*60*60*24);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Периоды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.ДатаНачала = &ДатаНачала
	|	И Периоды.ПометкаУдаления = Ложь
	|	И Периоды.Произвольный = Ложь
	|	И Периоды.Периодичность = &Периодичность";
	
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНовогоПериода);
	Запрос.УстановитьПараметр("Периодичность",Периодичность);

	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Возврат Выборка.Ссылка;
	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ИнициализироватьСКДИсточника(ЭтаФорма,ШаблонПанели) Экспорт
	
	СхемаКомпоновкиДанныхИсточника  = ШаблонПанели.ИсточникДанных.СхемаКомпоновкиДанныхпоУмолчанию.Получить();
	
	//Из сохраненной КД текущей панели нам нужны Поля итогов и Вычисляемые поля
	Если ЗначениеЗаполнено(ШаблонПанели.СхемаКомпоновкиДанных) Тогда
		СхемаКомпоновкиДанныхПанели      = ЗначениеИзСтрокиВнутр(ШаблонПанели.СхемаКомпоновкиДанных);
    Иначе
		СхемаКомпоновкиДанныхПанели	      = Неопределено;
	КонецЕсли;	

	//Перенесем вычисляемые поля и итоги 
	  Если НЕ  СхемаКомпоновкиДанныхПанели = Неопределено Тогда
				
		СхемаКомпоновкиДанныхИсточника.ПоляИтога.Очистить();
		
		Для Каждого тПоле Из СхемаКомпоновкиДанныхПанели.ПоляИтога Цикл
			
			нПоле = СхемаКомпоновкиДанныхИсточника.ПоляИтога.Добавить();
			заполнитьЗначенияСвойств(нПоле,тПоле);
			Для Каждого ИтогГруппировка Из тПоле.Группировки Цикл
				нПоле.Группировки.Добавить(ИтогГруппировка);
			КонецЦикла;	

			
		КонецЦикла;	
		
		Для Каждого тПоле Из СхемаКомпоновкиДанныхПанели.ВычисляемыеПоля Цикл
			
			нПоле = СхемаКомпоновкиДанныхИсточника.ВычисляемыеПоля.Добавить();
			заполнитьЗначенияСвойств(нПоле,тПоле);
			
		КонецЦикла;	

		Для Каждого тПоле Из СхемаКомпоновкиДанныхПанели.Параметры Цикл
			
			нПоле = СхемаКомпоновкиДанныхИсточника.Параметры.Добавить();
			заполнитьЗначенияСвойств(нПоле,тПоле);
			
		КонецЦикла;
		
	КонецЕсли;	

	
	ЭтаФорма.URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхИсточника,ЭтаФорма.УникальныйИдентификатор);	
		
	
	Попытка
		ЭтаФорма.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.URLСхемы));
	Исключение
		
		СообщениеПользователю = Новый СообщениеПользователю;
		
		СтрокаШаблона = Нстр("ru = 'При инициализации настроек источника данных возникла ошибка:
		|%1'");
		
		Если Не ПустаяСтрока(СтрокаШаблона) тогда			
			СообщениеПользователю.Текст = СтрШаблон(СтрокаШаблона, ОписаниеОшибки());
		КонецЕсли;
		
		СообщениеПользователю.Сообщить();		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		
	КонецПопытки;

		
КонецПроцедуры	

Процедура ПолучитьТаблицуДанныхПакета(ЭтаФорма)
	
	ПакетДанных	        = ЭтаФорма.ШаблонПанели.ИсточникДанных;
	
	ОбщийОтбор = Новый Структура;
	ОбщийОтбор.Вставить("Сценарий",ЭтаФорма.Сценарий);
	ОбщийОтбор.Вставить("ПериодОтчета",ЭтаФорма.ПериодОтчета);
	ОбщийОтбор.Вставить("ПериодОкончания",ЭтаФорма.ПериодОкончания);
	ОбщийОтбор.Вставить("Валюта",ЭтаФорма.Валюта);
	ОбщийОтбор.Вставить("Организация",Справочники.Организации.ПустаяСсылка());

	
	//Добавить общий отбор по организации
	Для Каждого СтрОтбор Из ЭтаФорма.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если СтрОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация")
			И СтрОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ТипЗнч(СтрОтбор.ПравоеЗначение) =  Тип("СправочникСсылка.Организации") 
			И СтрОтбор.Использование Тогда		
			ОбщийОтбор.Вставить("Организация",СтрОтбор.ПравоеЗначение);
       КонецЕсли;
		
	КонецЦикла;	
	
	ИсточникОбъект = ЭтаФорма.ШаблонПанели.ИсточникДанных.ПолучитьОбъект();
	
	СоответствиеИспользуемыхИБ = Новый Соответствие;
	
	КлючевыеРеквизитыЗаполнены = Истина;
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПериодОтчета) Тогда
		КлючевыеРеквизитыЗаполнены = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ПериодОкончания) Тогда
        КлючевыеРеквизитыЗаполнены = Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтаФорма.Валюта) Тогда
		КлючевыеРеквизитыЗаполнены = Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЭтаФорма.Сценарий) Тогда
		КлючевыеРеквизитыЗаполнены = Ложь;
	КонецЕсли;
	
	Если НЕ КлючевыеРеквизитыЗаполнены Тогда
		ТаблицаДанных        = Справочники.АналитическиеПанели.ПолучитьОписаниеПустойТаблицыДанных(ЭтаФорма.URLСхемы);		
	Иначе	
		ТаблицаДанных        	= Справочники.АналитическиеПанели.ПолучитьТаблицуПоНаборуДанных(ОбщийОтбор,ИсточникОбъект,ЭтаФорма.ИспользуемыеИБ);		
		ИзмененКлючевойРеквизит = Ложь;
	КонецЕсли;
	
	ЭтаФорма.URLСхемыНастроек = ЭтаФорма.URLСхемы;
	ЭтаФорма.АдресТаблицыДанных   = ПоместитьВоВременноеХранилище(ТаблицаДанных,ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры	

// Добавляет в массив МассивВложенийВход pdf-представление табличного документа
// ТабДокументВход по аналитическому отчету ОтчетВход, предварительно сохранив
// табличный документ во временный pdf-файл.
Процедура ДобавитьВМассивВложениеАналитическогоОтчета(ОтчетВход, ТабДокументВход, МассивВложенийВход)
		
	МассивИмен = Новый Массив;
	
	Для Каждого Стр Из МассивВложенийВход Цикл
		МассивИмен.Добавить(Стр.ИмяФайла);
	КонецЦикла;	
	
	// Запишем во временный файл.
	Каталог = КаталогВременныхФайлов();
	ИмяВременногоФайла = "";
	ИмяВременногоФайла = ИмяВременногоФайла + Каталог;
	ИмяВременногоФайла = ИмяВременногоФайла + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ОтчетВход.ЗаголовокЭлемента,"z");
	
	ПроектИмениФайла =  ИмяВременногоФайла+".pdf";
	Инд=1;
	Пока НЕ МассивИмен.Найти(ПроектИмениФайла) = Неопределено Цикл
		ПроектИмениФайла = ИмяВременногоФайла+Строка(Инд)+".pdf";
		Инд = Инд+1;
	КонецЦикла;	
		
	ИмяВременногоФайла = ПроектИмениФайла;
	
	ТабДокументВход.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокументВход.АвтоМасштаб = Истина;
	
	ТабДокументВход.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
	// Добавим в результирующий массив.
	ПредставлениеОтчета = ОтчетВход.ЗаголовокЭлемента;
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ИмяФайла", ИмяВременногоФайла);
	СтруктураРезультат.Вставить("Представление", ПредставлениеОтчета);
	МассивВложенийВход.Добавить(СтруктураРезультат);	
		
КонецПроцедуры


// Возвращает текст в формате HTML, содержащий список вложений из массива 
// МассивПутейВложенийВход.
Функция ПолучитьТекстСпискаВложений(МассивПутейВложенийВход)
	РезультатФункции = "";
	Если ЗначениеЗаполнено(МассивПутейВложенийВход) Тогда
		Если МассивПутейВложенийВход.Количество() > 0 Тогда
			РезультатФункции = РезультатФункции + "<ul>";
			Для Каждого ТекМассивПутейВложенийВход Из МассивПутейВложенийВход Цикл
				РезультатФункции = РезультатФункции + "<li>";
				РезультатФункции = РезультатФункции + ТекМассивПутейВложенийВход.Представление;
			КонецЦикла;
			РезультатФункции = РезультатФункции + "</ul>";
		Иначе
			РезультатФункции = "";
		КонецЕсли;
	Иначе
		РезультатФункции = "";
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Отправляет получателю с адресом АдресПолучателяВход письмо с заголовком ЗаголовокПисьмаВход,
// текстом ТекстПисьмаВход и вложениями из массива МассивПутейВложенийВход с учетной записи
// УчетнаяЗаписьОтправкиВход. Добавляет в строку протокола рассылки СтрокаПротоколаВход
// информацию об успешности отправки.
Процедура ОтправитьПисьмоАналитическойРассылки(ЗаголовокПисьмаВход, ТекстПисьмаВход, МассивПутейВложенийВход, УчетнаяЗаписьОтправкиВход, АдресПолучателяВход, СтрокаПротоколаВход,ПараметрРассылки)
	
	// Сформируем письмо.
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тексты.Добавить(ТекстПисьмаВход, ТипТекстаПочтовогоСообщения.HTML);
	Письмо.Тема = ЗаголовокПисьмаВход;
	Письмо.ИмяОтправителя    = УчетнаяЗаписьОтправкиВход.ИмяПользователя;
	Письмо.Отправитель.Адрес = УчетнаяЗаписьОтправкиВход.АдресЭлектроннойПочты;
	Письмо.Получатели.Добавить(АдресПолучателяВход);
	Письмо.ОбработатьТексты();
	//Добавим вложения.
	Для Каждого ТекМассивПутейВложений Из МассивПутейВложенийВход Цикл
		Письмо.Вложения.Добавить(ТекМассивПутейВложений.ИмяФайла,ТекМассивПутейВложений.Представление);
	КонецЦикла;
		
	// Отправим письмо.
	Попытка
		УправлениеЭлектроннойПочтойУХ.ЗаписатьПисьмоВРегистр(Письмо,ПараметрРассылки);
		СтрокаПротоколаВход.РезультатРассылки = "ОК";
	Исключение
		СтрокаПротоколаВход.РезультатРассылки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
КонецПроцедуры



#КонецЕсли
